# Integration_methods
1. Реализовать для функции одной переменной расчет интеграла пятью методами:
прямоугольников, трапеций, парабол, кубических парабол и Буля. Сравнить с готовыми
математическими пакетами. Например,
https://docs.scipy.org/doc/scipy/tutorial/integrate.html
2. Провести исследование для разных функций на точность методов в зависимости от h.
Построить график ошибки, на котором в виде пяти кривых будет отображен результат
исследования. В качестве “достоверного”, “идеального” значения функции можно взять
результат вычисления интеграла с очень маленьким h, либо аналитическое решение с
подставленными числами.
3. *Реализовать метод Гаусса (применить квадратурные формулы для 2-6 узлов на
отрезке). Сравнить результаты для разных функций. Сравнить метод с реализованными
в 1 пункте.
4. *Реализовать для функции одной переменной расчет интеграла методом МонтеКарло. Повторить для функции двух переменных. Подумать, возможно ли использовать
другие из перечисленных методов для больших размерностей. Если возможно,
запрограммировать любой понравившийся метод для функции двух переменных.
Может помочь:
https://stackoverflow.com/questions/14071704/integrating-a-multidimensional-integral-in-scipy
